[NoCoverage] ArrowFunction
src/app/app.routes.ts:6:19
 export const routes: Routes = [
   {
     path: '',
-    loadChildren: () =>
-      import('./feature/products/products.routes').then((m) => m.productsRoutes),
+    loadChildren: () => undefined,
   },
 ];

[NoCoverage] ArrowFunction
src/app/app.routes.ts:7:57
   {
     path: '',
     loadChildren: () =>
-      import('./feature/products/products.routes').then((m) => m.productsRoutes),
+      import('./feature/products/products.routes').then(() => undefined),
   },
 ];
