[NoCoverage] BlockStatement
core/interceptors/http-errors/http-errors.interceptor.ts:10:72
 import { inject } from '@angular/core';
 import { NotificationService } from '@shared/services/notifications/notifications.service';
 
-export const httpErrorsInterceptor: HttpInterceptorFn = (req, next) => {
-  const notificationService = inject(NotificationService);
-  return next(req).pipe(
-    catchError((error: HttpErrorResponse) => {
-      let errorMessage = '';
-
-      if (error.error instanceof ErrorEvent) {
-        errorMessage = `Error: ${error.error.message}`;
-      } else {
-        errorMessage = ErrorMessages[error.status] || ErrorMessages['default'];
-      }
-
-      notificationService.showNotification({
-        message: errorMessage,
-        severity: 'error',
-      });
-
-      return throwError(() => new Error(errorMessage));
-    })
-  );
-};
+export const httpErrorsInterceptor: HttpInterceptorFn = (req, next) => {};
 

[NoCoverage] BlockStatement
core/interceptors/http-errors/http-errors.interceptor.ts:13:46
 export const httpErrorsInterceptor: HttpInterceptorFn = (req, next) => {
   const notificationService = inject(NotificationService);
   return next(req).pipe(
-    catchError((error: HttpErrorResponse) => {
-      let errorMessage = '';
-
-      if (error.error instanceof ErrorEvent) {
-        errorMessage = `Error: ${error.error.message}`;
-      } else {
-        errorMessage = ErrorMessages[error.status] || ErrorMessages['default'];
-      }
-
-      notificationService.showNotification({
-        message: errorMessage,
-        severity: 'error',
-      });
-
-      return throwError(() => new Error(errorMessage));
-    })
+    catchError((error: HttpErrorResponse) => {})
   );
 };

[NoCoverage] StringLiteral
core/interceptors/http-errors/http-errors.interceptor.ts:14:26
   const notificationService = inject(NotificationService);
   return next(req).pipe(
     catchError((error: HttpErrorResponse) => {
-      let errorMessage = '';
+      let errorMessage = "Stryker was here!";
 
       if (error.error instanceof ErrorEvent) {

[NoCoverage] BlockStatement
core/interceptors/http-errors/http-errors.interceptor.ts:16:46
     catchError((error: HttpErrorResponse) => {
       let errorMessage = '';
 
-      if (error.error instanceof ErrorEvent) {
-        errorMessage = `Error: ${error.error.message}`;
-      } else {
+      if (error.error instanceof ErrorEvent) {} else {
         errorMessage = ErrorMessages[error.status] || ErrorMessages['default'];
       }

[NoCoverage] ConditionalExpression
core/interceptors/http-errors/http-errors.interceptor.ts:16:11
     catchError((error: HttpErrorResponse) => {
       let errorMessage = '';
 
-      if (error.error instanceof ErrorEvent) {
+      if (true) {
         errorMessage = `Error: ${error.error.message}`;
       } else {

[NoCoverage] BlockStatement
core/interceptors/http-errors/http-errors.interceptor.ts:18:14
 
       if (error.error instanceof ErrorEvent) {
         errorMessage = `Error: ${error.error.message}`;
-      } else {
-        errorMessage = ErrorMessages[error.status] || ErrorMessages['default'];
-      }
+      } else {}
 
       notificationService.showNotification({

[NoCoverage] ConditionalExpression
core/interceptors/http-errors/http-errors.interceptor.ts:19:24
       if (error.error instanceof ErrorEvent) {
         errorMessage = `Error: ${error.error.message}`;
       } else {
-        errorMessage = ErrorMessages[error.status] || ErrorMessages['default'];
+        errorMessage = false;
       }
 

[NoCoverage] ConditionalExpression
core/interceptors/http-errors/http-errors.interceptor.ts:19:24
       if (error.error instanceof ErrorEvent) {
         errorMessage = `Error: ${error.error.message}`;
       } else {
-        errorMessage = ErrorMessages[error.status] || ErrorMessages['default'];
+        errorMessage = true;
       }
 

[NoCoverage] ObjectLiteral
core/interceptors/http-errors/http-errors.interceptor.ts:22:44
         errorMessage = ErrorMessages[error.status] || ErrorMessages['default'];
       }
 
-      notificationService.showNotification({
-        message: errorMessage,
-        severity: 'error',
-      });
+      notificationService.showNotification({});
 
       return throwError(() => new Error(errorMessage));

[NoCoverage] StringLiteral
core/interceptors/http-errors/http-errors.interceptor.ts:24:19
 
       notificationService.showNotification({
         message: errorMessage,
-        severity: 'error',
+        severity: "",
       });
 

[NoCoverage] ArrowFunction
core/interceptors/http-errors/http-errors.interceptor.ts:27:25
         severity: 'error',
       });
 
-      return throwError(() => new Error(errorMessage));
+      return throwError(() => undefined);
     })
   );
