[NoCoverage] ArrayDeclaration
app/feature/products/products.routes.ts:3:39
 import { Routes } from '@angular/router';
 
-export const productsRoutes: Routes = [
-  {
-    path: '',
-    loadComponent: () =>
-      import('./components/product-list/product-list.component').then(
-        (m) => m.ProductListComponent
-      ),
-  },
-  {
-    path: 'management',
-    loadComponent: () =>
-      import(
-        './components/product-management/product-management.component'
-      ).then((m) => m.ProductManagementComponent),
-  },
-  {
-    path: 'management/:id',
-    loadComponent: () =>
-      import(
-        './components/product-management/product-management.component'
-      ).then((m) => m.ProductManagementComponent),
-  },
-];
+export const productsRoutes: Routes = [];
 

[NoCoverage] ArrowFunction
app/feature/products/products.routes.ts:6:20
 export const productsRoutes: Routes = [
   {
     path: '',
-    loadComponent: () =>
-      import('./components/product-list/product-list.component').then(
-        (m) => m.ProductListComponent
-      ),
+    loadComponent: () => undefined,
   },
   {

[NoCoverage] StringLiteral
app/feature/products/products.routes.ts:7:14
   {
     path: '',
     loadComponent: () =>
-      import('./components/product-list/product-list.component').then(
+      import("").then(
         (m) => m.ProductListComponent
       ),

[NoCoverage] ArrowFunction
app/feature/products/products.routes.ts:8:9
     path: '',
     loadComponent: () =>
       import('./components/product-list/product-list.component').then(
-        (m) => m.ProductListComponent
+        () => undefined
       ),
   },

[NoCoverage] ArrowFunction
app/feature/products/products.routes.ts:13:20
   },
   {
     path: 'management',
-    loadComponent: () =>
-      import(
-        './components/product-management/product-management.component'
-      ).then((m) => m.ProductManagementComponent),
+    loadComponent: () => undefined,
   },
   {

[NoCoverage] StringLiteral
app/feature/products/products.routes.ts:15:9
     path: 'management',
     loadComponent: () =>
       import(
-        './components/product-management/product-management.component'
+        ""
       ).then((m) => m.ProductManagementComponent),
   },

[NoCoverage] ArrowFunction
app/feature/products/products.routes.ts:16:14
     loadComponent: () =>
       import(
         './components/product-management/product-management.component'
-      ).then((m) => m.ProductManagementComponent),
+      ).then(() => undefined),
   },
   {

[NoCoverage] ObjectLiteral
app/feature/products/products.routes.ts:18:3
         './components/product-management/product-management.component'
       ).then((m) => m.ProductManagementComponent),
   },
-  {
-    path: 'management/:id',
-    loadComponent: () =>
-      import(
-        './components/product-management/product-management.component'
-      ).then((m) => m.ProductManagementComponent),
-  },
+  {},
 ];
 

[NoCoverage] ArrowFunction
app/feature/products/products.routes.ts:20:20
   },
   {
     path: 'management/:id',
-    loadComponent: () =>
-      import(
-        './components/product-management/product-management.component'
-      ).then((m) => m.ProductManagementComponent),
+    loadComponent: () => undefined,
   },
 ];
