[Killed] BlockStatement
core/services/http/http.service.ts:21:25
   private createOptions(
     headers?: HttpHeaders,
     params?: HttpParams
-  ): HttpServiceOptions {
-    const options: HttpServiceOptions = {} as HttpServiceOptions;
-    if (headers) {
-      options.headers = headers;
-    }
-    if (params) {
-      options.params = params;
-    }
-    return options;
-  }
+  ): HttpServiceOptions {}
 
   doGet<T>(
killedBy: HttpService should include headers and params in GET request
statusReason: Error: Expected one matching request for criteria "Match URL: /api/products/test?param1=value1", found none. Requests received are: GET /api/products/test.

[Killed] BlockStatement
core/services/http/http.service.ts:23:18
     params?: HttpParams
   ): HttpServiceOptions {
     const options: HttpServiceOptions = {} as HttpServiceOptions;
-    if (headers) {
-      options.headers = headers;
-    }
+    if (headers) {}
     if (params) {
       options.params = params;
killedBy: HttpService should include headers and params in GET request
statusReason: Expected null to equal 'value'.

[Killed] ConditionalExpression
core/services/http/http.service.ts:23:9
     params?: HttpParams
   ): HttpServiceOptions {
     const options: HttpServiceOptions = {} as HttpServiceOptions;
-    if (headers) {
+    if (false) {
       options.headers = headers;
     }
killedBy: HttpService should include headers and params in GET request
statusReason: Expected null to equal 'value'.

[Killed] ConditionalExpression
core/services/http/http.service.ts:26:9
     if (headers) {
       options.headers = headers;
     }
-    if (params) {
+    if (false) {
       options.params = params;
     }
killedBy: HttpService should include headers and params in GET request
statusReason: Error: Expected one matching request for criteria "Match URL: /api/products/test?param1=value1", found none. Requests received are: GET /api/products/test.

[Killed] BlockStatement
core/services/http/http.service.ts:26:17
     if (headers) {
       options.headers = headers;
     }
-    if (params) {
-      options.params = params;
-    }
+    if (params) {}
     return options;
   }
killedBy: HttpService should include headers and params in GET request
statusReason: Error: Expected one matching request for criteria "Match URL: /api/products/test?param1=value1", found none. Requests received are: GET /api/products/test.

[Killed] BlockStatement
core/services/http/http.service.ts:36:20
     endpoint: string,
     params?: HttpParams,
     headers?: HttpHeaders
-  ): Observable<T> {
-    const url = `${this.baseUrl}/${endpoint}`;
-    const options = this.createOptions(headers, params);
-    return this.http.get<T>(url, options);
-  }
+  ): Observable<T> {}
 
   doPost<T>(
killedBy: HttpService should perform a GET request; ProductListComponent should delete a product and refresh the list; ProductManagementComponent should show notification on successful product update
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] BlockStatement
core/services/http/http.service.ts:47:20
     body: unknown,
     params?: HttpParams,
     headers?: HttpHeaders
-  ): Observable<T> {
-    const url = `${this.baseUrl}/${endpoint}`;
-    const options = this.createOptions(headers, params);
-    return this.http.post<T>(url, body, options);
-  }
+  ): Observable<T> {}
 
   doPut<T>(
killedBy: HttpService should perform a POST request; ProductsService should create product
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] StringLiteral
core/services/http/http.service.ts:48:17
     params?: HttpParams,
     headers?: HttpHeaders
   ): Observable<T> {
-    const url = `${this.baseUrl}/${endpoint}`;
+    const url = ``;
     const options = this.createOptions(headers, params);
     return this.http.post<T>(url, body, options);
killedBy: HttpService should perform a POST request; ProductsService should create product
statusReason: Error: Expected one matching request for criteria "Match URL: /api/products", found none. Requests received are: POST .

[Killed] BlockStatement
core/services/http/http.service.ts:58:20
     body: unknown,
     params?: HttpParams,
     headers?: HttpHeaders
-  ): Observable<T> {
-    const url = `${this.baseUrl}/${endpoint}`;
-    const options = this.createOptions(headers, params);
-    return this.http.put<T>(url, body, options);
-  }
+  ): Observable<T> {}
 
   doDelete<T>(
killedBy: HttpService should perform a PUT request; ProductsService should update product
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] BlockStatement
core/services/http/http.service.ts:68:20
     endpoint: string,
     params?: HttpParams,
     headers?: HttpHeaders
-  ): Observable<T> {
-    const url = `${this.baseUrl}/${endpoint}`;
-    const options = this.createOptions(headers, params);
-    return this.http.delete<T>(url, options);
-  }
+  ): Observable<T> {}
 
   doPatch<T>(
killedBy: HttpService should perform a DELETE request; ProductsService should delete product
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] BlockStatement
core/services/http/http.service.ts:79:20
     body: unknown,
     params?: HttpParams,
     headers?: HttpHeaders
-  ): Observable<T> {
-    const url = `${this.baseUrl}/${endpoint}`;
-    const options = this.createOptions(headers, params);
-    return this.http.patch<T>(url, body, options);
-  }
+  ): Observable<T> {}
 }
 
killedBy: HttpService should perform a PATCH request
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')
