[Killed] BlockStatement
products/components/product-list/product-list.component.ts:52:44
 })
 export class ProductListComponent {
   public tableColumns = signal(productsColumns) as WritableSignal<string[]>;
-  public filteredProducts = computed(() => {
-    const searchTerm = this.signalSearchTerm();
-    return new FilterProductsPipe().transform(
-      this.products(),
-      searchTerm || ''
-    );
-  });
+  public filteredProducts = computed(() => {});
   public searchTerm = new FormControl('');
   private signalSearchTerm = toSignal(this.searchTerm.valueChanges);
killedBy: ProductListComponent should filter products based on search term

[Killed] ConditionalExpression
products/components/product-list/product-list.component.ts:56:7
     const searchTerm = this.signalSearchTerm();
     return new FilterProductsPipe().transform(
       this.products(),
-      searchTerm || ''
+      false
     );
   });
killedBy: ProductListComponent should filter products based on search term
statusReason: Expected $.length = 2 to equal 1.

[Killed] ConditionalExpression
products/components/product-list/product-list.component.ts:56:7
     const searchTerm = this.signalSearchTerm();
     return new FilterProductsPipe().transform(
       this.products(),
-      searchTerm || ''
+      true
     );
   });
killedBy: ProductListComponent should filter products based on search term
statusReason: TypeError: searchTerm.toLowerCase is not a function

[Survived] BlockStatement
products/components/product-list/product-list.component.ts:65:17
   private productsService = inject(ProductsService);
   private dialogService = inject(DialogService);
 
-  constructor() {
-    this.getProducts();
-  }
+  constructor() {}
 
   public getProducts(): void {

[Killed] BlockStatement
products/components/product-list/product-list.component.ts:69:30
     this.getProducts();
   }
 
-  public getProducts(): void {
-    this.productsService.getProducts().subscribe((products) => {
-      this.products.set(products);
-    });
-  }
+  public getProducts(): void {}
 
   public deleteProduct(product: Product): void {
killedBy: ProductListComponent should initialize with a list of products
statusReason: Expected spy getProducts to have been called.

[Killed] BlockStatement
products/components/product-list/product-list.component.ts:70:64
   }
 
   public getProducts(): void {
-    this.productsService.getProducts().subscribe((products) => {
-      this.products.set(products);
-    });
+    this.productsService.getProducts().subscribe((products) => {});
   }
 
killedBy: ProductListComponent should filter products based on search term
statusReason: Expected $.length = 0 to equal 1.

[Killed] BlockStatement
products/components/product-list/product-list.component.ts:75:48
     });
   }
 
-  public deleteProduct(product: Product): void {
-    const dialogRef = this.dialogService.confirmDialog({
-      data: {
-        message: `¿Estás seguro de eliminar el producto ${product.name}?`,
-      },
-    });
-    dialogRef
-      .afterClosed()
-      .pipe(
-        mergeMap((result) => {
-          if (result) {
-            return this.productsService.deleteProduct(product.id);
-          }
-          return of(false);
-        })
-      )
-      .subscribe({
-        next: (result) => {
-          if (result) {
-            this.getProducts();
-          }
-        },
-      });
-  }
+  public deleteProduct(product: Product): void {}
 }
 
killedBy: ProductListComponent should delete a product and refresh the list
statusReason: Expected spy confirmDialog to have been called.

[Survived] ObjectLiteral
products/components/product-list/product-list.component.ts:77:13
 
   public deleteProduct(product: Product): void {
     const dialogRef = this.dialogService.confirmDialog({
-      data: {
-        message: `¿Estás seguro de eliminar el producto ${product.name}?`,
-      },
+      data: {},
     });
     dialogRef

[Killed] ConditionalExpression
products/components/product-list/product-list.component.ts:85:15
       .afterClosed()
       .pipe(
         mergeMap((result) => {
-          if (result) {
+          if (false) {
             return this.productsService.deleteProduct(product.id);
           }
killedBy: ProductListComponent should delete a product and refresh the list
statusReason: Expected spy deleteProduct to have been called with:
  [ 'default-id' ]
but it was never called.

[Killed] BlockStatement
products/components/product-list/product-list.component.ts:85:23
       .afterClosed()
       .pipe(
         mergeMap((result) => {
-          if (result) {
-            return this.productsService.deleteProduct(product.id);
-          }
+          if (result) {}
           return of(false);
         })
killedBy: ProductListComponent should delete a product and refresh the list
statusReason: Expected spy deleteProduct to have been called with:
  [ 'default-id' ]
but it was never called.

[Survived] BooleanLiteral
products/components/product-list/product-list.component.ts:88:21
           if (result) {
             return this.productsService.deleteProduct(product.id);
           }
-          return of(false);
+          return of(true);
         })
       )

[Survived] ObjectLiteral
products/components/product-list/product-list.component.ts:91:18
           return of(false);
         })
       )
-      .subscribe({
-        next: (result) => {
-          if (result) {
-            this.getProducts();
-          }
-        },
-      });
+      .subscribe({});
   }
 }

[Killed] BlockStatement
products/components/product-list/product-list.component.ts:92:27
         })
       )
       .subscribe({
-        next: (result) => {
-          if (result) {
-            this.getProducts();
-          }
-        },
+        next: (result) => {},
       });
   }
killedBy: ProductListComponent should delete a product and refresh the list
statusReason: Expected spy getProducts to have been called.

[Killed] BlockStatement
products/components/product-list/product-list.component.ts:93:23
       )
       .subscribe({
         next: (result) => {
-          if (result) {
-            this.getProducts();
-          }
+          if (result) {}
         },
       });
killedBy: ProductListComponent should delete a product and refresh the list
statusReason: Expected spy getProducts to have been called.

[Killed] ConditionalExpression
products/components/product-list/product-list.component.ts:93:15
       )
       .subscribe({
         next: (result) => {
-          if (result) {
+          if (false) {
             this.getProducts();
           }
killedBy: ProductListComponent should delete a product and refresh the list
statusReason: Expected spy getProducts to have been called.
