[Killed] BooleanLiteral
products/components/product-management/product-management.component.ts:43:26
 export class ProductManagementComponent implements OnInit {
   @Input() id!: string;
   public manageForm!: FormGroup;
-  public isEdit = signal(false);
+  public isEdit = signal(true);
   public minDate = signal(formatDate(new Date()));
   private fb = inject(FormBuilder);
killedBy: ProductManagementComponent should show notification on successful product creation
statusReason: Expected spy postProduct to have been called.

[Killed] BlockStatement
products/components/product-management/product-management.component.ts:49:17
   private productsService = inject(ProductsService);
   private notificationService = inject(NotificationService);
 
-  constructor() {
-    this.createForm();
-  }
+  constructor() {}
 
   ngOnInit(): void {
killedBy: ProductManagementComponent should create
statusReason: TypeError: Cannot read properties of undefined (reading 'controls')

[Killed] BlockStatement
products/components/product-management/product-management.component.ts:53:20
     this.createForm();
   }
 
-  ngOnInit(): void {
-    if (this.id) {
-      this.getProductById();
-      this.isEdit.set(true);
-      this.manageForm.controls['id'].disable();
-    }
-  }
+  ngOnInit(): void {}
 
   public submit(): void {
killedBy: ProductManagementComponent should call getProductById if id is provided
statusReason: Expected spy getProductById to have been called with:
  [ '123' ]
but it was never called.

[Killed] ConditionalExpression
products/components/product-management/product-management.component.ts:54:9
   }
 
   ngOnInit(): void {
-    if (this.id) {
+    if (false) {
       this.getProductById();
       this.isEdit.set(true);
killedBy: ProductManagementComponent should call getProductById if id is provided
statusReason: Expected spy getProductById to have been called with:
  [ '123' ]
but it was never called.

[Survived] BlockStatement
products/components/product-management/product-management.component.ts:54:18
   }
 
   ngOnInit(): void {
-    if (this.id) {
-      this.getProductById();
-      this.isEdit.set(true);
-      this.manageForm.controls['id'].disable();
-    }
+    if (this.id) {}
   }
 

[Killed] BooleanLiteral
products/components/product-management/product-management.component.ts:56:23
   ngOnInit(): void {
     if (this.id) {
       this.getProductById();
-      this.isEdit.set(true);
+      this.isEdit.set(false);
       this.manageForm.controls['id'].disable();
     }
killedBy: ProductManagementComponent should call getProductById if id is provided
statusReason: Expected false to be true.

[Killed] BlockStatement
products/components/product-management/product-management.component.ts:61:25
     }
   }
 
-  public submit(): void {
-    if (this.isEdit()) {
-      this.updateProduct();
-    } else {
-      this.createProduct();
-    }
-  }
+  public submit(): void {}
 
   public resetForm(): void {
killedBy: ProductManagementComponent should show notification on successful product update
statusReason: Expected spy putProduct to have been called.

[Killed] ConditionalExpression
products/components/product-management/product-management.component.ts:62:9
   }
 
   public submit(): void {
-    if (this.isEdit()) {
+    if (false) {
       this.updateProduct();
     } else {
killedBy: ProductManagementComponent should show notification on successful product update
statusReason: Expected spy putProduct to have been called.

[Killed] ConditionalExpression
products/components/product-management/product-management.component.ts:62:9
   }
 
   public submit(): void {
-    if (this.isEdit()) {
+    if (true) {
       this.updateProduct();
     } else {
killedBy: ProductManagementComponent should show notification on successful product creation
statusReason: Expected spy postProduct to have been called.

[Killed] BlockStatement
products/components/product-management/product-management.component.ts:64:12
   public submit(): void {
     if (this.isEdit()) {
       this.updateProduct();
-    } else {
-      this.createProduct();
-    }
+    } else {}
   }
 
killedBy: ProductManagementComponent should show notification on successful product creation
statusReason: Expected spy postProduct to have been called.

[Killed] BlockStatement
products/components/product-management/product-management.component.ts:69:28
     }
   }
 
-  public resetForm(): void {
-    this.manageForm.reset();
-  }
+  public resetForm(): void {}
 
   private updateProduct(): void {
killedBy: ProductManagementComponent should reset form
statusReason: Expected '123' to be null.

[Killed] BlockStatement
products/components/product-management/product-management.component.ts:73:33
     this.manageForm.reset();
   }
 
-  private updateProduct(): void {
-    this.productsService
-      .putProduct({
-        ...this.manageForm.value,
-        date_revision: this.manageForm.controls['date_revision'].value,
-        id: this.id,
-      })
-      .subscribe({
-        next: () => {
-          this.notificationService.showNotification({
-            message: 'Producto actualizado correctamente',
-            severity: 'success',
-          });
-        },
-      });
-  }
+  private updateProduct(): void {}
 
   private createProduct(): void {
killedBy: ProductManagementComponent should show notification on successful product update
statusReason: Expected spy putProduct to have been called.

[Survived] ObjectLiteral
products/components/product-management/product-management.component.ts:75:19
 
   private updateProduct(): void {
     this.productsService
-      .putProduct({
-        ...this.manageForm.value,
-        date_revision: this.manageForm.controls['date_revision'].value,
-        id: this.id,
-      })
+      .putProduct({})
       .subscribe({
         next: () => {

[Killed] StringLiteral
products/components/product-management/product-management.component.ts:77:49
     this.productsService
       .putProduct({
         ...this.manageForm.value,
-        date_revision: this.manageForm.controls['date_revision'].value,
+        date_revision: this.manageForm.controls[""].value,
         id: this.id,
       })
killedBy: ProductManagementComponent should show notification on successful product update
statusReason: TypeError: Cannot read properties of undefined (reading 'value')

[Killed] BlockStatement
products/components/product-management/product-management.component.ts:81:21
         id: this.id,
       })
       .subscribe({
-        next: () => {
-          this.notificationService.showNotification({
-            message: 'Producto actualizado correctamente',
-            severity: 'success',
-          });
-        },
+        next: () => {},
       });
   }
killedBy: ProductManagementComponent should show notification on successful product update
statusReason: Expected spy showNotification to have been called with:
  [ Object({ message: 'Producto actualizado correctamente', severity: 'success' }) ]
but it was never called.

[Killed] ObjectLiteral
products/components/product-management/product-management.component.ts:82:53
       })
       .subscribe({
         next: () => {
-          this.notificationService.showNotification({
-            message: 'Producto actualizado correctamente',
-            severity: 'success',
-          });
+          this.notificationService.showNotification({});
         },
       });
killedBy: ProductManagementComponent should show notification on successful product update
statusReason: Expected spy showNotification to have been called with:
  [ Object({ message: 'Producto actualizado correctamente', severity: 'success' }) ]
but actual calls were:
  [ Object({  }) ].

Call 0:
  Expected $[0] to have properties
      message: 'Producto actualizado correctamente'

[Killed] StringLiteral
products/components/product-management/product-management.component.ts:83:22
       .subscribe({
         next: () => {
           this.notificationService.showNotification({
-            message: 'Producto actualizado correctamente',
+            message: "",
             severity: 'success',
           });
killedBy: ProductManagementComponent should show notification on successful product update
statusReason: Expected spy showNotification to have been called with:
  [ Object({ message: 'Producto actualizado correctamente', severity: 'success' }) ]
but actual calls were:
  [ Object({ message: '', severity: 'success' }) ].

Call 0:
  Expected $[0].message = '' to equal 'Producto actualizado correctamente'.
Error: Expected spy showNotification to have been called with:

[Killed] StringLiteral
products/components/product-management/product-management.component.ts:84:23
         next: () => {
           this.notificationService.showNotification({
             message: 'Producto actualizado correctamente',
-            severity: 'success',
+            severity: "",
           });
         },
killedBy: ProductManagementComponent should show notification on successful product update
statusReason: Expected spy showNotification to have been called with:
  [ Object({ message: 'Producto actualizado correctamente', severity: 'success' }) ]
but actual calls were:
  [ Object({ message: 'Producto actualizado correctamente', severity: '' }) ].

Call 0:
  Expected $[0].severity = '' to equal 'success'.
Error: Expected spy showNotification to have been called with:

[Killed] StringLiteral
products/components/product-management/product-management.component.ts:92:51
 
   private createProduct(): void {
     this.productsService
-      .validateProductId(this.manageForm.controls['id'].value)
+      .validateProductId(this.manageForm.controls[""].value)
       .pipe(
         mergeMap((productExists) => {
killedBy: ProductManagementComponent should show notification on successful product creation
statusReason: TypeError: Cannot read properties of undefined (reading 'value')

[Killed] ConditionalExpression
products/components/product-management/product-management.component.ts:95:15
       .validateProductId(this.manageForm.controls['id'].value)
       .pipe(
         mergeMap((productExists) => {
-          if (productExists) {
+          if (true) {
             this.notificationService.showNotification({
               message: 'El ID del producto ya existe',
killedBy: ProductManagementComponent should show notification on successful product creation
statusReason: Expected spy postProduct to have been called.

[Killed] ConditionalExpression
products/components/product-management/product-management.component.ts:95:15
       .validateProductId(this.manageForm.controls['id'].value)
       .pipe(
         mergeMap((productExists) => {
-          if (productExists) {
+          if (false) {
             this.notificationService.showNotification({
               message: 'El ID del producto ya existe',
killedBy: ProductManagementComponent should show error notification if product ID already exists
statusReason: Expected spy showNotification to have been called with:
  [ Object({ message: 'El ID del producto ya existe', severity: 'error' }) ]
but it was never called.

[Survived] ObjectLiteral
products/components/product-management/product-management.component.ts:96:55
       .pipe(
         mergeMap((productExists) => {
           if (productExists) {
-            this.notificationService.showNotification({
-              message: 'El ID del producto ya existe',
-              severity: 'error',
-            });
+            this.notificationService.showNotification({});
             return of()
           } else {

[Killed] StringLiteral
products/components/product-management/product-management.component.ts:97:24
         mergeMap((productExists) => {
           if (productExists) {
             this.notificationService.showNotification({
-              message: 'El ID del producto ya existe',
+              message: "",
               severity: 'error',
             });
killedBy: ProductManagementComponent should show error notification if product ID already exists
statusReason: Expected spy showNotification to have been called with:
  [ Object({ message: 'El ID del producto ya existe', severity: 'error' }) ]
but actual calls were:
  [ Object({ message: '', severity: 'error' }) ].

Call 0:
  Expected $[0].message = '' to equal 'El ID del producto ya existe'.
Error: Expected spy showNotification to have been called with:

[Survived] ObjectLiteral
products/components/product-management/product-management.component.ts:102:53
             });
             return of()
           } else {
-            return this.productsService.postProduct({
-              ...this.manageForm.value,
-              date_revision: this.manageForm.controls['date_revision'].value,
-            });
+            return this.productsService.postProduct({});
           }
         })

[Survived] ObjectLiteral
products/components/product-management/product-management.component.ts:109:18
           }
         })
       )
-      .subscribe({
-        next: () => {
-          this.notificationService.showNotification({
-            message: 'Producto creado correctamente',
-            severity: 'success',
-          });
-        },
-      });
+      .subscribe({});
   }
 

[Killed] BlockStatement
products/components/product-management/product-management.component.ts:110:21
         })
       )
       .subscribe({
-        next: () => {
-          this.notificationService.showNotification({
-            message: 'Producto creado correctamente',
-            severity: 'success',
-          });
-        },
+        next: () => {},
       });
   }
killedBy: ProductManagementComponent should show notification on successful product creation
statusReason: Expected spy showNotification to have been called with:
  [ Object({ message: 'Producto creado correctamente', severity: 'success' }) ]
but it was never called.

[Killed] BlockStatement
products/components/product-management/product-management.component.ts:119:34
       });
   }
 
-  private getProductById(): void {
-    this.productsService.getProductById(this.id).subscribe({
-      next: (product) => {
-        this.manageForm.patchValue(product);
-      },
-      error: () => {
-        this.manageForm.disable();
-      },
-    });
-  }
+  private getProductById(): void {}
 
   private createForm(): void {
killedBy: ProductManagementComponent should call getProductById if id is provided
statusReason: Expected spy getProductById to have been called with:
  [ '123' ]
but it was never called.

[Survived] BlockStatement
products/components/product-management/product-management.component.ts:121:26
 
   private getProductById(): void {
     this.productsService.getProductById(this.id).subscribe({
-      next: (product) => {
-        this.manageForm.patchValue(product);
-      },
+      next: (product) => {},
       error: () => {
         this.manageForm.disable();

[Killed] BlockStatement
products/components/product-management/product-management.component.ts:124:20
       next: (product) => {
         this.manageForm.patchValue(product);
       },
-      error: () => {
-        this.manageForm.disable();
-      },
+      error: () => {},
     });
   }
killedBy: ProductManagementComponent should disable form if getProductById fails
statusReason: Expected false to be true.

[Survived] StringLiteral
products/components/product-management/product-management.component.ts:133:9
   private createForm(): void {
     this.manageForm = this.fb.group({
       id: [
-        '',
+        "Stryker was here!",
         [
           Validators.required,

[Survived] ArrayDeclaration
products/components/product-management/product-management.component.ts:134:9
     this.manageForm = this.fb.group({
       id: [
         '',
-        [
-          Validators.required,
-          Validators.minLength(3),
-          Validators.maxLength(10),
-        ],
+        [],
       ],
       name: [

[Survived] StringLiteral
products/components/product-management/product-management.component.ts:149:9
         ],
       ],
       description: [
-        '',
+        "Stryker was here!",
         [
           Validators.required,

[Survived] ArrayDeclaration
products/components/product-management/product-management.component.ts:158:9
       ],
       date_release: [
         '',
-        [Validators.required, minDateValidator(this.minDate())],
+        [],
       ],
       date_revision: [{ value: '', disabled: true }],

[Survived] BooleanLiteral
products/components/product-management/product-management.component.ts:160:46
         '',
         [Validators.required, minDateValidator(this.minDate())],
       ],
-      date_revision: [{ value: '', disabled: true }],
+      date_revision: [{ value: '', disabled: false }],
       logo: ['', Validators.required],
     });

[Survived] BlockStatement
products/components/product-management/product-management.component.ts:166:37
     this.listenDateRelease();
   }
 
-  private listenDateRelease(): void {
-    this.manageForm.controls['date_release'].valueChanges.subscribe({
-      next: (value) => {
-        const date = new Date(value);
-        date.setHours(0, 0, 0, 0);
-        date.setFullYear(date.getFullYear() + 1);
-        date.setDate(date.getDate() + 1);
-        this.manageForm.controls['date_revision'].setValue(formatDate(date));
-      },
-    });
-  }
+  private listenDateRelease(): void {}
 }
 

[Survived] ObjectLiteral
products/components/product-management/product-management.component.ts:167:69
   }
 
   private listenDateRelease(): void {
-    this.manageForm.controls['date_release'].valueChanges.subscribe({
-      next: (value) => {
-        const date = new Date(value);
-        date.setHours(0, 0, 0, 0);
-        date.setFullYear(date.getFullYear() + 1);
-        date.setDate(date.getDate() + 1);
-        this.manageForm.controls['date_revision'].setValue(formatDate(date));
-      },
-    });
+    this.manageForm.controls['date_release'].valueChanges.subscribe({});
   }
 }

[Survived] BlockStatement
products/components/product-management/product-management.component.ts:168:24
 
   private listenDateRelease(): void {
     this.manageForm.controls['date_release'].valueChanges.subscribe({
-      next: (value) => {
-        const date = new Date(value);
-        date.setHours(0, 0, 0, 0);
-        date.setFullYear(date.getFullYear() + 1);
-        date.setDate(date.getDate() + 1);
-        this.manageForm.controls['date_revision'].setValue(formatDate(date));
-      },
+      next: (value) => {},
     });
   }

[Survived] ArithmeticOperator
products/components/product-management/product-management.component.ts:171:26
       next: (value) => {
         const date = new Date(value);
         date.setHours(0, 0, 0, 0);
-        date.setFullYear(date.getFullYear() + 1);
+        date.setFullYear(date.getFullYear() - 1);
         date.setDate(date.getDate() + 1);
         this.manageForm.controls['date_revision'].setValue(formatDate(date));

[Survived] ArithmeticOperator
products/components/product-management/product-management.component.ts:172:22
         const date = new Date(value);
         date.setHours(0, 0, 0, 0);
         date.setFullYear(date.getFullYear() + 1);
-        date.setDate(date.getDate() + 1);
+        date.setDate(date.getDate() - 1);
         this.manageForm.controls['date_revision'].setValue(formatDate(date));
       },
