[Survived] BlockStatement
products/shared/pipes/local-date.pipe.ts:8:62
   standalone: true,
 })
 export class LocalDatePipe implements PipeTransform {
-  transform(value: string | Date | undefined | null): string {
-    if (!value) return '';
-    const date = new Date(value);
-    if (isNaN(date.getTime())) {
-      return '';
-    }
-    const localDateString = date.toISOString().split('T')[0];
-    const [year, month, day] = localDateString.split('-');
-
-    return `${day}/${month}/${year}`;
-  }
+  transform(value: string | Date | undefined | null): string {}
 }
 

[Killed] BooleanLiteral
products/shared/pipes/local-date.pipe.ts:9:9
 })
 export class LocalDatePipe implements PipeTransform {
   transform(value: string | Date | undefined | null): string {
-    if (!value) return '';
+    if (value) return '';
     const date = new Date(value);
     if (isNaN(date.getTime())) {
killedBy: LocalDatePipe should transform a valid date string to local date format
statusReason: Expected '' to be '01/01/2023'.

[Killed] ConditionalExpression
products/shared/pipes/local-date.pipe.ts:9:9
 })
 export class LocalDatePipe implements PipeTransform {
   transform(value: string | Date | undefined | null): string {
-    if (!value) return '';
+    if (true) return '';
     const date = new Date(value);
     if (isNaN(date.getTime())) {
killedBy: LocalDatePipe should transform a valid date string to local date format
statusReason: Expected '' to be '01/01/2023'.

[Killed] BlockStatement
products/shared/pipes/local-date.pipe.ts:11:32
   transform(value: string | Date | undefined | null): string {
     if (!value) return '';
     const date = new Date(value);
-    if (isNaN(date.getTime())) {
-      return '';
-    }
+    if (isNaN(date.getTime())) {}
     const localDateString = date.toISOString().split('T')[0];
     const [year, month, day] = localDateString.split('-');
killedBy: LocalDatePipe should handle invalid date strings
statusReason: RangeError: Invalid time value

[Killed] ConditionalExpression
products/shared/pipes/local-date.pipe.ts:11:9
   transform(value: string | Date | undefined | null): string {
     if (!value) return '';
     const date = new Date(value);
-    if (isNaN(date.getTime())) {
+    if (true) {
       return '';
     }
killedBy: LocalDatePipe should transform a valid date string to local date format
statusReason: Expected '' to be '01/01/2023'.

[Killed] StringLiteral
products/shared/pipes/local-date.pipe.ts:17:12
     const localDateString = date.toISOString().split('T')[0];
     const [year, month, day] = localDateString.split('-');
 
-    return `${day}/${month}/${year}`;
+    return ``;
   }
 }
killedBy: LocalDatePipe should transform a valid date string to local date format
statusReason: Expected '' to be '01/01/2023'.
