[Survived] BlockStatement
products/shared/pipes/products-filter.pipe.ts:9:65
   standalone: true,
 })
 export class FilterProductsPipe implements PipeTransform {
-  transform(products: Product[], searchTerm: string): Product[] {
-    if (!products || !searchTerm) {
-      return products;
-    }
-    searchTerm = searchTerm.toLowerCase().trim();
-    return products.filter((product) =>
-      this.matchesSearchTerm(product, searchTerm)
-    );
-  }
+  transform(products: Product[], searchTerm: string): Product[] {}
 
   private matchesSearchTerm(product: Product, searchTerm: string): boolean {

[Killed] ConditionalExpression
products/shared/pipes/products-filter.pipe.ts:10:9
 })
 export class FilterProductsPipe implements PipeTransform {
   transform(products: Product[], searchTerm: string): Product[] {
-    if (!products || !searchTerm) {
+    if (true) {
       return products;
     }
killedBy: ProductListComponent should filter products based on search term; FilterProductsPipe should return an empty array if no products match the search term
statusReason: Expected $.length = 2 to equal 1.

[Killed] BooleanLiteral
products/shared/pipes/products-filter.pipe.ts:10:22
 })
 export class FilterProductsPipe implements PipeTransform {
   transform(products: Product[], searchTerm: string): Product[] {
-    if (!products || !searchTerm) {
+    if (!products || searchTerm) {
       return products;
     }
killedBy: ProductListComponent should filter products based on search term; FilterProductsPipe should return an empty array if no products match the search term
statusReason: Expected $.length = 2 to equal 1.

[Killed] MethodExpression
products/shared/pipes/products-filter.pipe.ts:13:18
     if (!products || !searchTerm) {
       return products;
     }
-    searchTerm = searchTerm.toLowerCase().trim();
+    searchTerm = searchTerm.toUpperCase().trim();
     return products.filter((product) =>
       this.matchesSearchTerm(product, searchTerm)
killedBy: ProductListComponent should filter products based on search term; FilterProductsPipe should filter products based on the search term
statusReason: Expected $.length = 0 to equal 1.

[Survived] MethodExpression
products/shared/pipes/products-filter.pipe.ts:13:18
     if (!products || !searchTerm) {
       return products;
     }
-    searchTerm = searchTerm.toLowerCase().trim();
+    searchTerm = searchTerm.toLowerCase();
     return products.filter((product) =>
       this.matchesSearchTerm(product, searchTerm)

[Killed] ArrowFunction
products/shared/pipes/products-filter.pipe.ts:14:28
       return products;
     }
     searchTerm = searchTerm.toLowerCase().trim();
-    return products.filter((product) =>
-      this.matchesSearchTerm(product, searchTerm)
+    return products.filter(() => undefined
     );
   }
killedBy: ProductListComponent should filter products based on search term; FilterProductsPipe should filter products based on the search term
statusReason: Expected $.length = 0 to equal 1.

[Killed] MethodExpression
products/shared/pipes/products-filter.pipe.ts:14:12
       return products;
     }
     searchTerm = searchTerm.toLowerCase().trim();
-    return products.filter((product) =>
-      this.matchesSearchTerm(product, searchTerm)
-    );
+    return products;
   }
 
killedBy: ProductListComponent should filter products based on search term; FilterProductsPipe should return an empty array if no products match the search term
statusReason: Expected $.length = 2 to equal 1.

[Killed] BlockStatement
products/shared/pipes/products-filter.pipe.ts:19:76
     );
   }
 
-  private matchesSearchTerm(product: Product, searchTerm: string): boolean {
-    return Object.values(product).some(value =>
-      String(value).toLowerCase().includes(searchTerm)
-    );
-  }
+  private matchesSearchTerm(product: Product, searchTerm: string): boolean {}
 }
 
killedBy: ProductListComponent should filter products based on search term; FilterProductsPipe should filter products based on the search term
statusReason: Expected $.length = 0 to equal 1.

[Killed] ArrowFunction
products/shared/pipes/products-filter.pipe.ts:20:40
   }
 
   private matchesSearchTerm(product: Product, searchTerm: string): boolean {
-    return Object.values(product).some(value =>
-      String(value).toLowerCase().includes(searchTerm)
+    return Object.values(product).some(() => undefined
     );
   }
killedBy: ProductListComponent should filter products based on search term; FilterProductsPipe should filter products based on the search term
statusReason: Expected $.length = 0 to equal 1.

[Survived] MethodExpression
products/shared/pipes/products-filter.pipe.ts:20:12
   }
 
   private matchesSearchTerm(product: Product, searchTerm: string): boolean {
-    return Object.values(product).some(value =>
-      String(value).toLowerCase().includes(searchTerm)
-    );
+    return Object.values(product).every(value => String(value).toLowerCase().includes(searchTerm));
   }
 }

[Killed] MethodExpression
products/shared/pipes/products-filter.pipe.ts:21:7
 
   private matchesSearchTerm(product: Product, searchTerm: string): boolean {
     return Object.values(product).some(value =>
-      String(value).toLowerCase().includes(searchTerm)
+      String(value).toUpperCase().includes(searchTerm)
     );
   }
killedBy: ProductListComponent should filter products based on search term; FilterProductsPipe should filter products based on the search term
statusReason: Expected $.length = 0 to equal 1.
