[Killed] BlockStatement
products/shared/services/products.service.ts:10:47
 export class ProductsService {
   private httpService = inject(HttpService);
 
-  public getProducts(): Observable<Product[]> {
-    return this.httpService
-      .doGet<{ data: Product[] }>('products')
-      .pipe(map((response) => response.data));
-  }
+  public getProducts(): Observable<Product[]> {}
 
   public getProductById(id: string): Observable<Product> {
killedBy: ProductListComponent should create; ProductsService should fetch products
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] ArrowFunction
products/shared/services/products.service.ts:13:17
   public getProducts(): Observable<Product[]> {
     return this.httpService
       .doGet<{ data: Product[] }>('products')
-      .pipe(map((response) => response.data));
+      .pipe(map(() => undefined));
   }
 
killedBy: ProductsService should fetch products

[Survived] BlockStatement
products/shared/services/products.service.ts:16:58
       .pipe(map((response) => response.data));
   }
 
-  public getProductById(id: string): Observable<Product> {
-    return this.httpService.doGet<Product>(`products/${id}`);
-  }
+  public getProductById(id: string): Observable<Product> {}
 
   public putProduct(

[Killed] BlockStatement
products/shared/services/products.service.ts:22:53
 
   public putProduct(
     product: Product
-  ): Observable<{ message: string; data: Product }> {
-    return this.httpService.doPut<{ message: string; data: Product }>(
-      `products/${product.id}`,
-      product
-    );
-  }
+  ): Observable<{ message: string; data: Product }> {}
 
   public postProduct(
killedBy: ProductsService should update product
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Killed] BlockStatement
products/shared/services/products.service.ts:31:53
 
   public postProduct(
     product: Product
-  ): Observable<{ message: string; data: Product }> {
-    return this.httpService.doPost<{ message: string; data: Product }>(
-      'products',
-      product
-    );
-  }
+  ): Observable<{ message: string; data: Product }> {}
 
   public deleteProduct(id: string): Observable<{ message: string }> {
killedBy: ProductsService should create product
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')

[Survived] BlockStatement
products/shared/services/products.service.ts:38:69
     );
   }
 
-  public deleteProduct(id: string): Observable<{ message: string }> {
-    return this.httpService.doDelete<{ message: string }>(`products/${id}`);
-  }
+  public deleteProduct(id: string): Observable<{ message: string }> {}
 
   public validateProductId(id: string): Observable<boolean> {

[Killed] BlockStatement
products/shared/services/products.service.ts:42:61
     return this.httpService.doDelete<{ message: string }>(`products/${id}`);
   }
 
-  public validateProductId(id: string): Observable<boolean> {
-    return this.httpService.doGet<boolean>(`products/verification/${id}`);
-  }
+  public validateProductId(id: string): Observable<boolean> {}
 }
 
killedBy: ProductsService should validate product ID
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')
