[Killed] BooleanLiteral
app/shared/class/abstract-control-value-accessor.ts:29:32
 export abstract class AbstractControlValueAccessor<T>
   implements ControlValueAccessor, AfterViewInit
 {
-  @Input() disabled: boolean = false;
+  @Input() disabled: boolean = true;
   @Input() placeholder!: string;
   @Input() label!: string;
killedBy: AbstractControlValueAccessor should initialize control and set disabled state in ngAfterViewInit
statusReason: Expected true to be false.

[Survived] BooleanLiteral
app/shared/class/abstract-control-value-accessor.ts:36:35
   value = new FormControl('');
   public name!: string;
   public control!: FormControl;
-  public hasErrorsSignal = signal(false);
+  public hasErrorsSignal = signal(true);
   public isRequired = signal(false);
   private injector = inject(Injector);

[Survived] BooleanLiteral
app/shared/class/abstract-control-value-accessor.ts:37:30
   public name!: string;
   public control!: FormControl;
   public hasErrorsSignal = signal(false);
-  public isRequired = signal(false);
+  public isRequired = signal(true);
   private injector = inject(Injector);
 

[Killed] BlockStatement
app/shared/class/abstract-control-value-accessor.ts:45:27
   onTouch: () => void = () => {
   };
 
-  ngAfterViewInit(): void {
-    const ngControl: NgControl | null = this.injector.get(NgControl, null);
-    if (ngControl) {
-      this.control = ngControl.control as FormControl;
-      this.setDisabledState(!!ngControl?.control?.disabled);
-      this.verifyRequired();
-    }
-  }
+  ngAfterViewInit(): void {}
 
   writeValue(value: string): void {
killedBy: AbstractControlValueAccessor should initialize control and set disabled state in ngAfterViewInit
statusReason: Expected undefined to be defined.

[Killed] BlockStatement
app/shared/class/abstract-control-value-accessor.ts:47:20
 
   ngAfterViewInit(): void {
     const ngControl: NgControl | null = this.injector.get(NgControl, null);
-    if (ngControl) {
-      this.control = ngControl.control as FormControl;
-      this.setDisabledState(!!ngControl?.control?.disabled);
-      this.verifyRequired();
-    }
+    if (ngControl) {}
   }
 
killedBy: AbstractControlValueAccessor should initialize control and set disabled state in ngAfterViewInit
statusReason: Expected undefined to be defined.

[Killed] ConditionalExpression
app/shared/class/abstract-control-value-accessor.ts:47:9
 
   ngAfterViewInit(): void {
     const ngControl: NgControl | null = this.injector.get(NgControl, null);
-    if (ngControl) {
+    if (false) {
       this.control = ngControl.control as FormControl;
       this.setDisabledState(!!ngControl?.control?.disabled);
killedBy: AbstractControlValueAccessor should initialize control and set disabled state in ngAfterViewInit
statusReason: Expected undefined to be defined.

[Killed] BooleanLiteral
app/shared/class/abstract-control-value-accessor.ts:49:29
     const ngControl: NgControl | null = this.injector.get(NgControl, null);
     if (ngControl) {
       this.control = ngControl.control as FormControl;
-      this.setDisabledState(!!ngControl?.control?.disabled);
+      this.setDisabledState(!ngControl?.control?.disabled);
       this.verifyRequired();
     }
killedBy: AbstractControlValueAccessor should initialize control and set disabled state in ngAfterViewInit
statusReason: Expected true to be false.

[Killed] BlockStatement
app/shared/class/abstract-control-value-accessor.ts:54:35
     }
   }
 
-  writeValue(value: string): void {
-    this.value.setValue(value);
-    this.onChange(value);
-    this.hasErrors();
-  }
+  writeValue(value: string): void {}
 
   registerOnChange(fn: (value: string | null) => void): void {
killedBy: AbstractControlValueAccessor should write value and call onChange
statusReason: Expected '' to be 'test value'.

[Killed] BlockStatement
app/shared/class/abstract-control-value-accessor.ts:60:62
     this.hasErrors();
   }
 
-  registerOnChange(fn: (value: string | null) => void): void {
-    this.onChange = fn;
-  }
+  registerOnChange(fn: (value: string | null) => void): void {}
 
   registerOnTouched(fn: () => void): void {
killedBy: AbstractControlValueAccessor should register onChange function
statusReason: Expected Function to be Function.

[Killed] BlockStatement
app/shared/class/abstract-control-value-accessor.ts:64:43
     this.onChange = fn;
   }
 
-  registerOnTouched(fn: () => void): void {
-    this.onTouch = fn;
-    this.hasErrors();
-  }
+  registerOnTouched(fn: () => void): void {}
 
   onTouched(): void {
killedBy: AbstractControlValueAccessor should register onTouch function
statusReason: Expected Function to be Function.

[Killed] BlockStatement
app/shared/class/abstract-control-value-accessor.ts:69:21
     this.hasErrors();
   }
 
-  onTouched(): void {
-    this.onTouch();
-    this.hasErrors();
-  }
+  onTouched(): void {}
 
   setDisabledState(isDisabled: boolean): void {
killedBy: AbstractControlValueAccessor should call onTouch and hasErrors in onTouched
statusReason: Expected spy onTouch to have been called.

[Killed] BlockStatement
app/shared/class/abstract-control-value-accessor.ts:74:47
     this.hasErrors();
   }
 
-  setDisabledState(isDisabled: boolean): void {
-    if (this.disabled || isDisabled) this.value.disable();
-  }
+  setDisabledState(isDisabled: boolean): void {}
 
   public verifyRequired(): void {
killedBy: AbstractControlValueAccessor should disable control if setDisabledState is called with true
statusReason: Expected false to be true.

[Killed] ConditionalExpression
app/shared/class/abstract-control-value-accessor.ts:75:9
   }
 
   setDisabledState(isDisabled: boolean): void {
-    if (this.disabled || isDisabled) this.value.disable();
+    if (true) this.value.disable();
   }
 
killedBy: AbstractControlValueAccessor should initialize control and set disabled state in ngAfterViewInit
statusReason: Expected true to be false.

[Killed] LogicalOperator
app/shared/class/abstract-control-value-accessor.ts:75:9
   }
 
   setDisabledState(isDisabled: boolean): void {
-    if (this.disabled || isDisabled) this.value.disable();
+    if (this.disabled && isDisabled) this.value.disable();
   }
 
killedBy: AbstractControlValueAccessor should disable control if setDisabledState is called with true
statusReason: Expected false to be true.

[Killed] BlockStatement
app/shared/class/abstract-control-value-accessor.ts:78:33
     if (this.disabled || isDisabled) this.value.disable();
   }
 
-  public verifyRequired(): void {
-    if (this.control.hasValidator(Validators.required)) {
-      this.isRequired.set(true);
-    }
-  }
+  public verifyRequired(): void {}
 
   private hasErrors(): void {
killedBy: AbstractControlValueAccessor should verify required validator
statusReason: Expected false to be true.

[Killed] ConditionalExpression
app/shared/class/abstract-control-value-accessor.ts:79:9
   }
 
   public verifyRequired(): void {
-    if (this.control.hasValidator(Validators.required)) {
+    if (false) {
       this.isRequired.set(true);
     }
killedBy: AbstractControlValueAccessor should verify required validator
statusReason: Expected false to be true.

[Killed] BlockStatement
app/shared/class/abstract-control-value-accessor.ts:79:57
   }
 
   public verifyRequired(): void {
-    if (this.control.hasValidator(Validators.required)) {
-      this.isRequired.set(true);
-    }
+    if (this.control.hasValidator(Validators.required)) {}
   }
 
killedBy: AbstractControlValueAccessor should verify required validator
statusReason: Expected false to be true.

[Killed] BooleanLiteral
app/shared/class/abstract-control-value-accessor.ts:80:27
 
   public verifyRequired(): void {
     if (this.control.hasValidator(Validators.required)) {
-      this.isRequired.set(true);
+      this.isRequired.set(false);
     }
   }
killedBy: AbstractControlValueAccessor should verify required validator
statusReason: Expected false to be true.

[Killed] BlockStatement
app/shared/class/abstract-control-value-accessor.ts:84:29
     }
   }
 
-  private hasErrors(): void {
-    this.hasErrorsSignal.set(this.control?.invalid && this.control?.touched);
-  }
+  private hasErrors(): void {}
 }
 
killedBy: AbstractControlValueAccessor should set hasErrorsSignal to true if control is invalid and touched
statusReason: Expected false to be true.

[Killed] ConditionalExpression
app/shared/class/abstract-control-value-accessor.ts:85:30
   }
 
   private hasErrors(): void {
-    this.hasErrorsSignal.set(this.control?.invalid && this.control?.touched);
+    this.hasErrorsSignal.set(true);
   }
 }
killedBy: AbstractControlValueAccessor should set hasErrorsSignal to false if control is valid or not touched
statusReason: Expected true to be false.

[Killed] OptionalChaining
app/shared/class/abstract-control-value-accessor.ts:85:30
   }
 
   private hasErrors(): void {
-    this.hasErrorsSignal.set(this.control?.invalid && this.control?.touched);
+    this.hasErrorsSignal.set(this.control.invalid && this.control?.touched);
   }
 }
killedBy: ProductManagementComponent should create
statusReason: Error: 1 component threw errors during cleanup
