[Survived] OptionalChaining
shared/components/confirm-dialog/confirm-dialog.component.ts:17:29
 export class ConfirmDialogComponent {
   private dialogRef = inject(DialogRef);
   private dialogData = inject(DIALOG_DATA);
-  public readonly message = this.dialogData?.message;
+  public readonly message = this.dialogData.message;
 
   public onCancel(): void {

[Killed] BlockStatement
shared/components/confirm-dialog/confirm-dialog.component.ts:19:27
   private dialogData = inject(DIALOG_DATA);
   public readonly message = this.dialogData?.message;
 
-  public onCancel(): void {
-    this.dialogRef.close();
-  }
+  public onCancel(): void {}
 
   public onConfirm(): void {
killedBy: ConfirmDialogComponent should close dialog on cancel
statusReason: Expected spy DialogRef.close to have been called.

[Killed] BlockStatement
shared/components/confirm-dialog/confirm-dialog.component.ts:23:28
     this.dialogRef.close();
   }
 
-  public onConfirm(): void {
-    this.dialogRef.close(true);
-  }
+  public onConfirm(): void {}
 }
 
killedBy: ConfirmDialogComponent should close dialog with true on confirm
statusReason: Expected spy DialogRef.close to have been called with:
  [ true ]
but it was never called.

[Killed] BooleanLiteral
shared/components/confirm-dialog/confirm-dialog.component.ts:24:26
   }
 
   public onConfirm(): void {
-    this.dialogRef.close(true);
+    this.dialogRef.close(false);
   }
 }
killedBy: ConfirmDialogComponent should close dialog with true on confirm
statusReason: Expected spy DialogRef.close to have been called with:
  [ true ]
but actual calls were:
  [ false ].

Call 0:
  Expected $[0] = false to equal true.
Error: Expected spy DialogRef.close to have been called with:
