[Survived] BooleanLiteral
components/forms/validator/validator.component.ts:15:28
 export class ValidatorComponent implements OnInit {
   @Input() public control!: FormControl;
 
-  public hasError = signal(false);
+  public hasError = signal(true);
   private name = '';
 

[Killed] BlockStatement
components/forms/validator/validator.component.ts:20:20
 
   constructor() {}
 
-  ngOnInit(): void {
-    const fieldName: string = this.getControlName();
-    this.name = fieldName;
-  }
+  ngOnInit(): void {}
 
   public message(errors: any): string {
killedBy: ValidatorComponent should initialize control name on ngOnInit
statusReason: Expected '' to be 'testControl'.

[Killed] BlockStatement
components/forms/validator/validator.component.ts:25:39
     this.name = fieldName;
   }
 
-  public message(errors: any): string {
-    if (errors?.required) return 'Campo requerido';
-    if (errors?.minlength)
-      return `Debe tener al menos ${errors.minlength.requiredLength} caracteres`;
-    if (errors?.maxlength)
-      return `Debe tener máximo ${errors.maxlength.requiredLength} caracteres`;
-    if (errors?.minDate)
-      return `La fecha debe ser mayor o igual a ${errors.minDate.value}`;
-    return '';
-  }
+  public message(errors: any): string {}
 
   private getControlName(): string {
killedBy: ValidatorComponent should return "Campo requerido" for required error
statusReason: Expected undefined to be 'Campo requerido'.

[Killed] OptionalChaining
components/forms/validator/validator.component.ts:26:9
   }
 
   public message(errors: any): string {
-    if (errors?.required) return 'Campo requerido';
+    if (errors.required) return 'Campo requerido';
     if (errors?.minlength)
       return `Debe tener al menos ${errors.minlength.requiredLength} caracteres`;
killedBy: ValidatorComponent should create
statusReason: TypeError: Cannot read properties of null (reading 'required')

[Killed] ConditionalExpression
components/forms/validator/validator.component.ts:26:9
   }
 
   public message(errors: any): string {
-    if (errors?.required) return 'Campo requerido';
+    if (false) return 'Campo requerido';
     if (errors?.minlength)
       return `Debe tener al menos ${errors.minlength.requiredLength} caracteres`;
killedBy: ValidatorComponent should return "Campo requerido" for required error
statusReason: Expected '' to be 'Campo requerido'.

[Killed] ConditionalExpression
components/forms/validator/validator.component.ts:27:9
 
   public message(errors: any): string {
     if (errors?.required) return 'Campo requerido';
-    if (errors?.minlength)
+    if (true)
       return `Debe tener al menos ${errors.minlength.requiredLength} caracteres`;
     if (errors?.maxlength)
killedBy: ValidatorComponent should create
statusReason: TypeError: Cannot read properties of null (reading 'minlength')

[Killed] OptionalChaining
components/forms/validator/validator.component.ts:27:9
 
   public message(errors: any): string {
     if (errors?.required) return 'Campo requerido';
-    if (errors?.minlength)
+    if (errors.minlength)
       return `Debe tener al menos ${errors.minlength.requiredLength} caracteres`;
     if (errors?.maxlength)
killedBy: ValidatorComponent should create
statusReason: TypeError: Cannot read properties of null (reading 'minlength')

[Killed] ConditionalExpression
components/forms/validator/validator.component.ts:29:9
     if (errors?.required) return 'Campo requerido';
     if (errors?.minlength)
       return `Debe tener al menos ${errors.minlength.requiredLength} caracteres`;
-    if (errors?.maxlength)
+    if (true)
       return `Debe tener máximo ${errors.maxlength.requiredLength} caracteres`;
     if (errors?.minDate)
killedBy: ValidatorComponent should create
statusReason: TypeError: Cannot read properties of null (reading 'maxlength')

[Killed] OptionalChaining
components/forms/validator/validator.component.ts:29:9
     if (errors?.required) return 'Campo requerido';
     if (errors?.minlength)
       return `Debe tener al menos ${errors.minlength.requiredLength} caracteres`;
-    if (errors?.maxlength)
+    if (errors.maxlength)
       return `Debe tener máximo ${errors.maxlength.requiredLength} caracteres`;
     if (errors?.minDate)
killedBy: ValidatorComponent should create
statusReason: TypeError: Cannot read properties of null (reading 'maxlength')

[Killed] StringLiteral
components/forms/validator/validator.component.ts:30:14
     if (errors?.minlength)
       return `Debe tener al menos ${errors.minlength.requiredLength} caracteres`;
     if (errors?.maxlength)
-      return `Debe tener máximo ${errors.maxlength.requiredLength} caracteres`;
+      return ``;
     if (errors?.minDate)
       return `La fecha debe ser mayor o igual a ${errors.minDate.value}`;
killedBy: ValidatorComponent should return maxlength error message
statusReason: Expected '' to be 'Debe tener máximo 10 caracteres'.

[Killed] OptionalChaining
components/forms/validator/validator.component.ts:31:9
       return `Debe tener al menos ${errors.minlength.requiredLength} caracteres`;
     if (errors?.maxlength)
       return `Debe tener máximo ${errors.maxlength.requiredLength} caracteres`;
-    if (errors?.minDate)
+    if (errors.minDate)
       return `La fecha debe ser mayor o igual a ${errors.minDate.value}`;
     return '';
killedBy: ValidatorComponent should create
statusReason: TypeError: Cannot read properties of null (reading 'minDate')

[Killed] ConditionalExpression
components/forms/validator/validator.component.ts:31:9
       return `Debe tener al menos ${errors.minlength.requiredLength} caracteres`;
     if (errors?.maxlength)
       return `Debe tener máximo ${errors.maxlength.requiredLength} caracteres`;
-    if (errors?.minDate)
+    if (true)
       return `La fecha debe ser mayor o igual a ${errors.minDate.value}`;
     return '';
killedBy: ValidatorComponent should create
statusReason: TypeError: Cannot read properties of null (reading 'minDate')

[Killed] BlockStatement
components/forms/validator/validator.component.ts:36:36
     return '';
   }
 
-  private getControlName(): string {
-    let controlName = '';
-    const parent = this.control['parent'];
-
-    if (parent instanceof FormGroup) {
-      for (const name in parent.controls) {
-        if (this.control === parent.controls[name]) {
-          controlName = name;
-        }
-      }
-    }
-
-    return controlName;
-  }
+  private getControlName(): string {}
 }
 
killedBy: ValidatorComponent should initialize control name on ngOnInit
statusReason: Expected undefined to be 'testControl'.

[Survived] StringLiteral
components/forms/validator/validator.component.ts:37:23
   }
 
   private getControlName(): string {
-    let controlName = '';
+    let controlName = "Stryker was here!";
     const parent = this.control['parent'];
 

[Killed] StringLiteral
components/forms/validator/validator.component.ts:38:33
 
   private getControlName(): string {
     let controlName = '';
-    const parent = this.control['parent'];
+    const parent = this.control[""];
 
     if (parent instanceof FormGroup) {
killedBy: ValidatorComponent should initialize control name on ngOnInit
statusReason: Expected '' to be 'testControl'.

[Killed] BlockStatement
components/forms/validator/validator.component.ts:40:38
     let controlName = '';
     const parent = this.control['parent'];
 
-    if (parent instanceof FormGroup) {
-      for (const name in parent.controls) {
-        if (this.control === parent.controls[name]) {
-          controlName = name;
-        }
-      }
-    }
+    if (parent instanceof FormGroup) {}
 
     return controlName;
killedBy: ValidatorComponent should initialize control name on ngOnInit
statusReason: Expected '' to be 'testControl'.

[Killed] ConditionalExpression
components/forms/validator/validator.component.ts:40:9
     let controlName = '';
     const parent = this.control['parent'];
 
-    if (parent instanceof FormGroup) {
+    if (false) {
       for (const name in parent.controls) {
         if (this.control === parent.controls[name]) {
killedBy: ValidatorComponent should initialize control name on ngOnInit
statusReason: Expected '' to be 'testControl'.

[Killed] BlockStatement
components/forms/validator/validator.component.ts:41:43
     const parent = this.control['parent'];
 
     if (parent instanceof FormGroup) {
-      for (const name in parent.controls) {
-        if (this.control === parent.controls[name]) {
-          controlName = name;
-        }
-      }
+      for (const name in parent.controls) {}
     }
 
killedBy: ValidatorComponent should initialize control name on ngOnInit
statusReason: Expected '' to be 'testControl'.

[Killed] BlockStatement
components/forms/validator/validator.component.ts:42:53
 
     if (parent instanceof FormGroup) {
       for (const name in parent.controls) {
-        if (this.control === parent.controls[name]) {
-          controlName = name;
-        }
+        if (this.control === parent.controls[name]) {}
       }
     }
killedBy: ValidatorComponent should initialize control name on ngOnInit
statusReason: Expected '' to be 'testControl'.

[Killed] ConditionalExpression
components/forms/validator/validator.component.ts:42:13
 
     if (parent instanceof FormGroup) {
       for (const name in parent.controls) {
-        if (this.control === parent.controls[name]) {
+        if (false) {
           controlName = name;
         }
killedBy: ValidatorComponent should initialize control name on ngOnInit
statusReason: Expected '' to be 'testControl'.
