[Survived] StringLiteral
shared/components/notification/notification.component.ts:15:30
   changeDetection: ChangeDetectionStrategy.OnPush,
 })
 export class NotificationComponent {
-  @Input() message: string = '';
+  @Input() message: string = "Stryker was here!";
   @Input() severity: 'info' | 'success' | 'warning' | 'error' | undefined = 'info';
 }
