[Killed] ArrayDeclaration
shared/components/table/table.component.ts:25:39
 })
 export class TableComponent<T> {
   @Input({ required: true }) columns!: WritableSignal<string[]>;
-  @Input() data: Signal<T[]> = signal([]);
+  @Input() data: Signal<T[]> = signal(["Stryker was here"]);
   @Input() public pageSizes: number[] = [1, 5, 10, 20];
   @Input() private itemsPerPage: number = 5;
killedBy: TableComponent should update the currentPage value when nextPage is called
statusReason: Expected 0 to be 1.

[Killed] ArrowFunction
shared/components/table/table.component.ts:30:40
   @Input() private itemsPerPage: number = 5;
 
   public currentPage = signal(0);
-  public currentPageDisplay = computed(() => this.currentPage() + 1);
+  public currentPageDisplay = computed(() => undefined);
   public paginatedData = computed(() => {
     const start = this.currentPage() * this.itemsPerPageSignal();
killedBy: TableComponent should update the currentPage value when previousPage is called
statusReason: Expected undefined to be 2.

[Survived] ArithmeticOperator
shared/components/table/table.component.ts:30:46
   @Input() private itemsPerPage: number = 5;
 
   public currentPage = signal(0);
-  public currentPageDisplay = computed(() => this.currentPage() + 1);
+  public currentPageDisplay = computed(() => this.currentPage() - 1);
   public paginatedData = computed(() => {
     const start = this.currentPage() * this.itemsPerPageSignal();

[Killed] BlockStatement
shared/components/table/table.component.ts:31:41
 
   public currentPage = signal(0);
   public currentPageDisplay = computed(() => this.currentPage() + 1);
-  public paginatedData = computed(() => {
-    const start = this.currentPage() * this.itemsPerPageSignal();
-    const end = start + this.itemsPerPageSignal();
-    return this.data().slice(start, end);
-  });
+  public paginatedData = computed(() => {});
   public totalPages = computed(() =>
     Math.ceil(this.data().length / this.itemsPerPageSignal())
killedBy: TableComponent should update the currentPage value when nextPage is called
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Survived] ArithmeticOperator
shared/components/table/table.component.ts:32:19
   public currentPage = signal(0);
   public currentPageDisplay = computed(() => this.currentPage() + 1);
   public paginatedData = computed(() => {
-    const start = this.currentPage() * this.itemsPerPageSignal();
+    const start = this.currentPage() / this.itemsPerPageSignal();
     const end = start + this.itemsPerPageSignal();
     return this.data().slice(start, end);

[Survived] ArithmeticOperator
shared/components/table/table.component.ts:33:17
   public currentPageDisplay = computed(() => this.currentPage() + 1);
   public paginatedData = computed(() => {
     const start = this.currentPage() * this.itemsPerPageSignal();
-    const end = start + this.itemsPerPageSignal();
+    const end = start - this.itemsPerPageSignal();
     return this.data().slice(start, end);
   });

[Survived] MethodExpression
shared/components/table/table.component.ts:34:12
   public paginatedData = computed(() => {
     const start = this.currentPage() * this.itemsPerPageSignal();
     const end = start + this.itemsPerPageSignal();
-    return this.data().slice(start, end);
+    return this.data();
   });
   public totalPages = computed(() =>

[Killed] ArrowFunction
shared/components/table/table.component.ts:36:32
     const end = start + this.itemsPerPageSignal();
     return this.data().slice(start, end);
   });
-  public totalPages = computed(() =>
-    Math.ceil(this.data().length / this.itemsPerPageSignal())
+  public totalPages = computed(() => undefined
   );
   public dataQuantity = computed(() => {
killedBy: TableComponent should update the currentPage value when previousPage is called
statusReason: Expected 0 to be 1.

[Survived] ArithmeticOperator
shared/components/table/table.component.ts:37:15
     return this.data().slice(start, end);
   });
   public totalPages = computed(() =>
-    Math.ceil(this.data().length / this.itemsPerPageSignal())
+    Math.ceil(this.data().length * this.itemsPerPageSignal())
   );
   public dataQuantity = computed(() => {

[Survived] BlockStatement
shared/components/table/table.component.ts:39:40
   public totalPages = computed(() =>
     Math.ceil(this.data().length / this.itemsPerPageSignal())
   );
-  public dataQuantity = computed(() => {
-    return this.data().length;
-  });
+  public dataQuantity = computed(() => {});
   public itemsPerPageSignal = signal(this.itemsPerPage);
 

[Survived] BlockStatement
shared/components/table/table.component.ts:46:17
 
   @ContentChild('rowTemplate', { static: true }) rowTemplate!: TemplateRef<any>;
 
-  constructor() {
-    effect(
-      () => {
-        this.data();
-        this.currentPage.set(0);
-      },
-      {
-        allowSignalWrites: true,
-      }
-    );
-  }
+  constructor() {}
 
   public nextPage(): void {

[Survived] BlockStatement
shared/components/table/table.component.ts:48:13
 
   constructor() {
     effect(
-      () => {
-        this.data();
-        this.currentPage.set(0);
-      },
+      () => {},
       {
         allowSignalWrites: true,

[Survived] BooleanLiteral
shared/components/table/table.component.ts:53:28
         this.currentPage.set(0);
       },
       {
-        allowSignalWrites: true,
+        allowSignalWrites: false,
       }
     );

[Survived] BlockStatement
shared/components/table/table.component.ts:58:27
     );
   }
 
-  public nextPage(): void {
-    if (this.currentPage() < this.totalPages() - 1) {
-      this.currentPage.update((page) => page + 1);
-    }
-  }
+  public nextPage(): void {}
 
   public previousPage(): void {

[Killed] EqualityOperator
shared/components/table/table.component.ts:59:9
   }
 
   public nextPage(): void {
-    if (this.currentPage() < this.totalPages() - 1) {
+    if (this.currentPage() <= this.totalPages() - 1) {
       this.currentPage.update((page) => page + 1);
     }
killedBy: TableComponent should not update the currentPage value when nextPage is called and already on the last page
statusReason: Expected 0 to be -1.

[Survived] ConditionalExpression
shared/components/table/table.component.ts:59:9
   }
 
   public nextPage(): void {
-    if (this.currentPage() < this.totalPages() - 1) {
+    if (false) {
       this.currentPage.update((page) => page + 1);
     }

[Survived] ArithmeticOperator
shared/components/table/table.component.ts:60:41
 
   public nextPage(): void {
     if (this.currentPage() < this.totalPages() - 1) {
-      this.currentPage.update((page) => page + 1);
+      this.currentPage.update((page) => page - 1);
     }
   }

[Survived] ArrowFunction
shared/components/table/table.component.ts:60:31
 
   public nextPage(): void {
     if (this.currentPage() < this.totalPages() - 1) {
-      this.currentPage.update((page) => page + 1);
+      this.currentPage.update(() => undefined);
     }
   }

[Killed] BlockStatement
shared/components/table/table.component.ts:64:31
     }
   }
 
-  public previousPage(): void {
-    if (this.currentPage() > 0) {
-      this.currentPage.update((page) => page - 1);
-    }
-  }
+  public previousPage(): void {}
 
   public changePageSize(size: Event): void {
killedBy: TableComponent should update the currentPage value when previousPage is called
statusReason: Expected 1 to be 0.

[Survived] ConditionalExpression
shared/components/table/table.component.ts:65:9
   }
 
   public previousPage(): void {
-    if (this.currentPage() > 0) {
+    if (true) {
       this.currentPage.update((page) => page - 1);
     }

[Survived] EqualityOperator
shared/components/table/table.component.ts:65:9
   }
 
   public previousPage(): void {
-    if (this.currentPage() > 0) {
+    if (this.currentPage() >= 0) {
       this.currentPage.update((page) => page - 1);
     }

[Killed] ArrowFunction
shared/components/table/table.component.ts:66:31
 
   public previousPage(): void {
     if (this.currentPage() > 0) {
-      this.currentPage.update((page) => page - 1);
+      this.currentPage.update(() => undefined);
     }
   }
killedBy: TableComponent should update the currentPage value when previousPage is called
statusReason: Expected undefined to be 0.

[Survived] ArithmeticOperator
shared/components/table/table.component.ts:66:41
 
   public previousPage(): void {
     if (this.currentPage() > 0) {
-      this.currentPage.update((page) => page - 1);
+      this.currentPage.update((page) => page + 1);
     }
   }

[Survived] BlockStatement
shared/components/table/table.component.ts:70:44
     }
   }
 
-  public changePageSize(size: Event): void {
-    const selectedSize = (size.target as HTMLSelectElement).value;
-    this.itemsPerPageSignal.set(parseInt(selectedSize));
-    this.currentPage.set(0);
-  }
+  public changePageSize(size: Event): void {}
 }
 
