[Survived] ArrayDeclaration
app/shared/directives/menu.directive.ts:32:24
       positionStrategy: this.overlay
         .position()
         .flexibleConnectedTo(this.elementRef)
-        .withPositions([
-          {
-            originX: 'start',
-            originY: 'bottom',
-            overlayX: 'start',
-            overlayY: 'top',
-          },
-        ]),
+        .withPositions([]),
       hasBackdrop: true,
       backdropClass: 'cdk-overlay-transparent-backdrop',

[Survived] BooleanLiteral
app/shared/directives/menu.directive.ts:40:20
             overlayY: 'top',
           },
         ]),
-      hasBackdrop: true,
+      hasBackdrop: false,
       backdropClass: 'cdk-overlay-transparent-backdrop',
       panelClass: 'menu-panel',

[Survived] ObjectLiteral
app/shared/directives/menu.directive.ts:49:47
 
     const menuOverlayRef = this.overlayRef.attach(portalRef);
 
-    this.overlayRef.backdropClick().subscribe({
-      next: () => {
-        this.overlayRef.dispose();
-      },
-    });
+    this.overlayRef.backdropClick().subscribe({});
 
     menuOverlayRef.rootNodes.forEach((node) => {

[Survived] BlockStatement
app/shared/directives/menu.directive.ts:50:19
     const menuOverlayRef = this.overlayRef.attach(portalRef);
 
     this.overlayRef.backdropClick().subscribe({
-      next: () => {
-        this.overlayRef.dispose();
-      },
+      next: () => {},
     });
 

[Survived] BlockStatement
app/shared/directives/menu.directive.ts:55:48
       },
     });
 
-    menuOverlayRef.rootNodes.forEach((node) => {
-      node.addEventListener('click', () => {
-        this.overlayRef.dispose();
-      });
-    });
+    menuOverlayRef.rootNodes.forEach((node) => {});
   }
 }

[Killed] BlockStatement
app/shared/directives/menu.directive.ts:56:44
     });
 
     menuOverlayRef.rootNodes.forEach((node) => {
-      node.addEventListener('click', () => {
-        this.overlayRef.dispose();
-      });
+      node.addEventListener('click', () => {});
     });
   }
killedBy: MenuDirective should close menu on menu item click
statusReason: Expected <div class="menu-item">...</div> to be falsy.
