[Killed] BlockStatement
app/shared/functions/format-date.ts:1:54
-export function formatDate(customDate: Date): string {
-  const year = customDate.getFullYear();
-  const month = String(customDate.getMonth() + 1).padStart(2, '0');
-  const day = String(customDate.getDate()).padStart(2, '0');
-  return `${year}-${month}-${day}`;
-}
+export function formatDate(customDate: Date): string {}
killedBy: formatDate should handle leap years
statusReason: Expected undefined to be '2023-01-01'.

[Killed] ArithmeticOperator
app/shared/functions/format-date.ts:3:24
 export function formatDate(customDate: Date): string {
   const year = customDate.getFullYear();
-  const month = String(customDate.getMonth() + 1).padStart(2, '0');
+  const month = String(customDate.getMonth() - 1).padStart(2, '0');
   const day = String(customDate.getDate()).padStart(2, '0');
   return `${year}-${month}-${day}`;
killedBy: formatDate should handle leap years
statusReason: Expected '2023--1-01' to be '2023-01-01'.

[Killed] StringLiteral
app/shared/functions/format-date.ts:4:56
 export function formatDate(customDate: Date): string {
   const year = customDate.getFullYear();
   const month = String(customDate.getMonth() + 1).padStart(2, '0');
-  const day = String(customDate.getDate()).padStart(2, '0');
+  const day = String(customDate.getDate()).padStart(2, "");
   return `${year}-${month}-${day}`;
 }
killedBy: formatDate should handle leap years
statusReason: Expected '2023-01-1' to be '2023-01-01'.
