[Killed] BlockStatement
app/shared/functions/min-date-validator.ts:3:64
 import { AbstractControl, ValidatorFn } from '@angular/forms';
 
-export function minDateValidator(minDate: string): ValidatorFn {
-  return (control: AbstractControl): { [key: string]: any } | null => {
-    if (!control.value) {
-      return null;
-    }
-
-    const inputDate = new Date(control.value);
-    const min = new Date(minDate);
-
-    return inputDate >= min ? null : { minDate: { value: minDate } };
-  };
-}
+export function minDateValidator(minDate: string): ValidatorFn {}
 
killedBy: minDateValidator should return null for valid date greater than or equal to minDate; ProductManagementComponent should create
statusReason: TypeError: validator is not a function

[Killed] BlockStatement
app/shared/functions/min-date-validator.ts:4:71
 import { AbstractControl, ValidatorFn } from '@angular/forms';
 
 export function minDateValidator(minDate: string): ValidatorFn {
-  return (control: AbstractControl): { [key: string]: any } | null => {
-    if (!control.value) {
-      return null;
-    }
-
-    const inputDate = new Date(control.value);
-    const min = new Date(minDate);
-
-    return inputDate >= min ? null : { minDate: { value: minDate } };
-  };
+  return (control: AbstractControl): { [key: string]: any } | null => {};
 }
 
killedBy: minDateValidator should return null for valid date equal to minDate
statusReason: Expected undefined to be null.

[Killed] BlockStatement
app/shared/functions/min-date-validator.ts:5:25
 
 export function minDateValidator(minDate: string): ValidatorFn {
   return (control: AbstractControl): { [key: string]: any } | null => {
-    if (!control.value) {
-      return null;
-    }
+    if (!control.value) {}
 
     const inputDate = new Date(control.value);
killedBy: minDateValidator should return null for empty control value
statusReason: Expected Object({ minDate: Object({ value: '2023-01-01' }) }) to be null.

[Survived] ConditionalExpression
app/shared/functions/min-date-validator.ts:5:9
 
 export function minDateValidator(minDate: string): ValidatorFn {
   return (control: AbstractControl): { [key: string]: any } | null => {
-    if (!control.value) {
+    if (false) {
       return null;
     }

[Killed] EqualityOperator
app/shared/functions/min-date-validator.ts:12:12
     const inputDate = new Date(control.value);
     const min = new Date(minDate);
 
-    return inputDate >= min ? null : { minDate: { value: minDate } };
+    return inputDate < min ? null : { minDate: { value: minDate } };
   };
 }
killedBy: minDateValidator should return null for valid date equal to minDate
statusReason: Expected Object({ minDate: Object({ value: '2023-01-01' }) }) to be null.

[Killed] ConditionalExpression
app/shared/functions/min-date-validator.ts:12:12
     const inputDate = new Date(control.value);
     const min = new Date(minDate);
 
-    return inputDate >= min ? null : { minDate: { value: minDate } };
+    return false ? null : { minDate: { value: minDate } };
   };
 }
killedBy: minDateValidator should return null for valid date equal to minDate
statusReason: Expected Object({ minDate: Object({ value: '2023-01-01' }) }) to be null.
