[Survived] BlockStatement
shared/services/dialog/dialog-ref.ts:9:30
 
   constructor(private overlayRef: OverlayRef) {}
 
-  public close(result?: any) {
-    this.overlayRef.dispose();
-    this.afterClosedSubject.next(result);
-    this.afterClosedSubject.complete();
-  }
+  public close(result?: any) {}
 
   public afterClosed(): Observable<any> {

[Survived] BlockStatement
shared/services/dialog/dialog-ref.ts:15:41
     this.afterClosedSubject.complete();
   }
 
-  public afterClosed(): Observable<any> {
-    return this.afterClosedSubject.asObservable();
-  }
+  public afterClosed(): Observable<any> {}
 }
 
