[Killed] BlockStatement
shared/services/dialog/dialog.service.ts:22:16
   public openDialog<T>(
     component: ComponentType<T>,
     config?: DialogConfig
-  ): DialogRef {
-    const overlayRef = this.createOverlay();
-    const dialogRef = this.createDialogRef(overlayRef);
-    const injector = this.createInjector(config, dialogRef);
-
-    this.attachDialogContainer<T>(component, overlayRef, injector);
-    this.setupBackdropClickClose(dialogRef, overlayRef);
-
-    return dialogRef;
-  }
+  ): DialogRef {}
 
   public confirmDialog(config?: DialogConfig): DialogRef {
killedBy: DialogService should open a dialog
statusReason: Expected spy create to have been called.

[Killed] BlockStatement
shared/services/dialog/dialog.service.ts:33:58
     return dialogRef;
   }
 
-  public confirmDialog(config?: DialogConfig): DialogRef {
-    return this.openDialog(ConfirmDialogComponent, config);
-  }
+  public confirmDialog(config?: DialogConfig): DialogRef {}
 
   private createOverlay(): OverlayRef {
killedBy: DialogService should create a confirm dialog
statusReason: Expected undefined to be truthy.

[Killed] BlockStatement
shared/services/dialog/dialog.service.ts:37:39
     return this.openDialog(ConfirmDialogComponent, config);
   }
 
-  private createOverlay(): OverlayRef {
-    const positionStrategy = this.overlay
-      .position()
-      .global()
-      .centerHorizontally()
-      .centerVertically();
-
-    return this.overlay.create({
-      hasBackdrop: true,
-      backdropClass: 'cdk-overlay-dark-backdrop',
-      panelClass: 'cdk-overlay-pane',
-      scrollStrategy: this.overlay.scrollStrategies.block(),
-      positionStrategy,
-    });
-  }
+  private createOverlay(): OverlayRef {}
 
   private createDialogRef(overlayRef: OverlayRef): DialogRef {
killedBy: DialogService should open a dialog
statusReason: TypeError: Cannot read properties of undefined (reading 'attach')

[Survived] BooleanLiteral
shared/services/dialog/dialog.service.ts:45:20
       .centerVertically();
 
     return this.overlay.create({
-      hasBackdrop: true,
+      hasBackdrop: false,
       backdropClass: 'cdk-overlay-dark-backdrop',
       panelClass: 'cdk-overlay-pane',

[Survived] StringLiteral
shared/services/dialog/dialog.service.ts:46:22
 
     return this.overlay.create({
       hasBackdrop: true,
-      backdropClass: 'cdk-overlay-dark-backdrop',
+      backdropClass: "",
       panelClass: 'cdk-overlay-pane',
       scrollStrategy: this.overlay.scrollStrategies.block(),

[Killed] BlockStatement
shared/services/dialog/dialog.service.ts:53:62
     });
   }
 
-  private createDialogRef(overlayRef: OverlayRef): DialogRef {
-    return new DialogRef(overlayRef);
-  }
+  private createDialogRef(overlayRef: OverlayRef): DialogRef {}
 
   private createInjector(
killedBy: DialogService should open a dialog
statusReason: Expected undefined to be truthy.

[Killed] BlockStatement
shared/services/dialog/dialog.service.ts:60:15
   private createInjector(
     config: DialogConfig | undefined,
     dialogRef: DialogRef
-  ): Injector {
-    const providers = [
-      { provide: DialogRef, useValue: dialogRef },
-      { provide: DIALOG_DATA, useValue: config?.data },
-    ];
-
-    return Injector.create({
-      parent: this.injector,
-      providers,
-    });
-  }
+  ): Injector {}
 
   private attachDialogContainer<T>(
killedBy: DialogService should open a dialog
statusReason: NullInjectorError: R3InjectorError(Standalone[ConfirmDialogComponent])[DialogRef -> DialogRef -> DialogRef]: 
  NullInjectorError: No provider for DialogRef!
error properties: Object({ ngTempTokenPath: null, ngTokenPath: [ 'DialogRef', 'DialogRef', 'DialogRef' ] })

[Killed] OptionalChaining
shared/services/dialog/dialog.service.ts:63:41
   ): Injector {
     const providers = [
       { provide: DialogRef, useValue: dialogRef },
-      { provide: DIALOG_DATA, useValue: config?.data },
+      { provide: DIALOG_DATA, useValue: config.data },
     ];
 
killedBy: DialogService should open a dialog
statusReason: TypeError: Cannot read properties of undefined (reading 'data')

[Survived] ObjectLiteral
shared/services/dialog/dialog.service.ts:63:7
   ): Injector {
     const providers = [
       { provide: DialogRef, useValue: dialogRef },
-      { provide: DIALOG_DATA, useValue: config?.data },
+      {},
     ];
 

[Survived] BlockStatement
shared/services/dialog/dialog.service.ts:76:11
     component: ComponentType<T>,
     overlayRef: OverlayRef,
     injector: Injector
-  ): void {
-    const portal = new ComponentPortal(component, null, injector);
-    overlayRef.attach(portal);
-  }
+  ): void {}
 
   private setupBackdropClickClose(

[Killed] BlockStatement
shared/services/dialog/dialog.service.ts:84:11
   private setupBackdropClickClose(
     dialogRef: DialogRef,
     overlayRef: OverlayRef
-  ): void {
-    overlayRef.backdropClick().subscribe({
-      next: () => {
-        dialogRef.close();
-      },
-    });
-  }
+  ): void {}
 }
 
killedBy: DialogService should close the dialog on backdrop click
statusReason: Expected spy close to have been called.

[Survived] ObjectLiteral
shared/services/dialog/dialog.service.ts:85:42
     dialogRef: DialogRef,
     overlayRef: OverlayRef
   ): void {
-    overlayRef.backdropClick().subscribe({
-      next: () => {
-        dialogRef.close();
-      },
-    });
+    overlayRef.backdropClick().subscribe({});
   }
 }

[Survived] BlockStatement
shared/services/dialog/dialog.service.ts:86:19
     overlayRef: OverlayRef
   ): void {
     overlayRef.backdropClick().subscribe({
-      next: () => {
-        dialogRef.close();
-      },
+      next: () => {},
     });
   }
