[Survived] BooleanLiteral
shared/services/notifications/notifications.service.ts:31:20
       .centerHorizontally();
     this.overlayRef = this.overlay.create({
       panelClass: 'cdk-overlay-pane-notification',
-      hasBackdrop: false,
+      hasBackdrop: true,
       positionStrategy,
     });

[Killed] LogicalOperator
shared/services/notifications/notifications.service.ts:40:11
     componentRef.instance.message = config.message;
     componentRef.instance.severity = config.severity;
 
-    timer(config.duration || 5000)
+    timer(config.duration && 5000)
       .pipe(takeUntil(this.destroy$))
       .subscribe({
killedBy: NotificationService should close the notification after the specified duration

[Survived] ConditionalExpression
shared/services/notifications/notifications.service.ts:40:11
     componentRef.instance.message = config.message;
     componentRef.instance.severity = config.severity;
 
-    timer(config.duration || 5000)
+    timer(false)
       .pipe(takeUntil(this.destroy$))
       .subscribe({

[Killed] BlockStatement
shared/services/notifications/notifications.service.ts:43:21
     timer(config.duration || 5000)
       .pipe(takeUntil(this.destroy$))
       .subscribe({
-        next: () => {
-          this.closeNotification();
-        },
+        next: () => {},
       });
   }
killedBy: NotificationService should close the notification after the specified duration

[Survived] BlockStatement
shared/services/notifications/notifications.service.ts:49:37
       });
   }
 
-  private closeNotification(): void {
-    if (this.overlayRef) {
-      this.overlayRef.dispose();
-      this.overlayRef = null;
-    }
-  }
+  private closeNotification(): void {}
 }
 

[Killed] BlockStatement
shared/services/notifications/notifications.service.ts:50:26
   }
 
   private closeNotification(): void {
-    if (this.overlayRef) {
-      this.overlayRef.dispose();
-      this.overlayRef = null;
-    }
+    if (this.overlayRef) {}
   }
 }
killedBy: NotificationService should close the notification after the specified duration

[Killed] ConditionalExpression
shared/services/notifications/notifications.service.ts:50:9
   }
 
   private closeNotification(): void {
-    if (this.overlayRef) {
+    if (false) {
       this.overlayRef.dispose();
       this.overlayRef = null;
killedBy: NotificationService should close the notification after the specified duration
