[Survived] StringLiteral
products/shared/const/products-columns.ts:2:3
 const productsColumns = Object.freeze([
-  'Logo',
+  "",
   'Nombre del producto',
   'Descripción',

[Survived] StringLiteral
products/shared/const/products-columns.ts:7:3
   'Descripción',
   'Fecha de liberación',
   'Fecha de reestructuración',
-  '',
+  "Stryker was here!",
 ]);
 
