[Survived] StringLiteral
shared/services/dialog/dialog-tokens.ts:3:52
 import { InjectionToken } from '@angular/core';
 
-export const DIALOG_DATA = new InjectionToken<any>('DIALOG_DATA');
+export const DIALOG_DATA = new InjectionToken<any>("");
 
